### M07 Paired Coding

Rachel Grace

6/29/22

In [1]:
import pandas as pd
import numpy as np

### Exercise 7.2

In [2]:
dat = pd.DataFrame({'features':[1.3, 3.5, 6.5], 'labels':[0, 1, 2]})

In [3]:
dat = dat.rename(columns = {'labels':'label'})

In [4]:
dat

   features  label
0       1.3      0
1       3.5      1
2       6.5      2

### Exercise 7.4

In [6]:
import seaborn as sns
iris = sns.load_dataset('iris')

setosa = iris[iris.species=='setosa']
setosa.species.value_counts()

setosa    50
Name: species, dtype: int64

### Exercise 7.6

In [7]:
iris['min_col'] = iris[['petal_length', 'petal_width']].apply(lambda x: min(x.petal_length, x.petal_width), axis = 1)

In [9]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species  min_col
0           5.1          3.5           1.4          0.2  setosa      0.2
1           4.9          3.0           1.4          0.2  setosa      0.2
2           4.7          3.2           1.3          0.2  setosa      0.2
3           4.6          3.1           1.5          0.2  setosa      0.2
4           5.0          3.6           1.4          0.2  setosa      0.2

In [10]:
iris.tail()

     sepal_length  sepal_width  petal_length  petal_width    species  min_col
145           6.7          3.0           5.2          2.3  virginica      2.3
146           6.3          2.5           5.0          1.9  virginica      1.9
147           6.5          3.0           5.2          2.0  virginica      2.0
148           6.2          3.4           5.4          2.3  virginica      2.3
149           5.9          3.0           5.1          1.8  virginica      1.8

### Exercise 7.8

In [29]:
#df1 = pd.DataFrame({'age':[25, 22, 22, 20]})
df1 = pd.DataFrame({'name':['Matt', 'Eve', 'Rachel', 'Josh'], 'age':[25, 22, 22, 20]})
df1 = df1.set_index('name')
df2 = pd.DataFrame({'name':['Matt', 'Eve', 'Rachel', 'Connor'], 'gender':['male', 'female', 'female', 'male']})
df2 = df2.set_index('name')

In [30]:
df1

        age
name
Matt     25
Eve      22
Rachel   22
Josh     20

In [31]:
df2

        gender
name
Matt      male
Eve     female
Rachel  female
Connor    male

In [32]:
pd.merge(df1, df2, on='name', how='inner')

        age  gender
name
Matt     25    male
Eve      22  female
Rachel   22  female

In [33]:
df1.join(df2, how = 'outer')

         age  gender
name
Connor   NaN    male
Eve     22.0  female
Josh    20.0     NaN
Matt    25.0    male
Rachel  22.0  female